uhnp/src/InformationRegisters/АналитикаКонтроляЗадолженностиПоКонтрагенту/АналитикаКонтроляЗадолженностиПоКонтрагенту.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АналитикаКонтроляЗадолженностиПоКонтрагенту</name>
  <resources>
    <name>КлючАналитики</name>
    <type>
      <types>CatalogRef.КлючиКонтроляЗадолженностиПоКонтрагенту</types>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РольКонтрагента</name>
    <type>
      <types>EnumRef.РолиКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Catalogs/КлючиКонтроляЗадолженностиПоКонтрагенту/КлючиКонтроляЗадолженностиПоКонтрагенту.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КлючиКонтроляЗадолженностиПоКонтрагенту</name>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>РольКонтрагента</name>
    <type>
      <types>EnumRef.РолиКонтрагентов</types>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/InformationRegisters/АналитикаКонтроляЗадолженностиПоКонтрагенту/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьПолноеНаименованиеКлючаАналитики(МенеджерЗаписи) Экспорт

	Возврат СокрЛП(МенеджерЗаписи.Контрагент) + ": " + СокрЛП(МенеджерЗаписи.РольКонтрагента);
	
КонецФункции

// Функция получает элемент справочника - ключ аналитики контроля задолженности контрагентов.
//
// Параметры:
//	ПараметрыАналитики - Выборка, Структура - Содержит полями "Контрагент, РольКонтрагента":
//		* Контрагент - СправочникСсылка.Контрагенты.
//		* РольКонтрагента - ПеречислениеСсылка.РолиКонтрагентов.
//
// Возвращаемое значение:
//	СправочникСсылка.КлючиКонтроляЗадолженностиПоКонтрагенту - Созданный элемент справочника.
//
Функция ЗначениеКлючаАналитики(ПараметрыАналитики) Экспорт

	НаборЗаписей = ПолучитьНаборЗаписей(ПараметрыАналитики);
	
	Если НаборЗаписей <> Неопределено Тогда
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() > 0
			И Не ЗначениеЗаполнено(НаборЗаписей[0].КлючАналитики) Тогда
			НаборЗаписей.Очистить();
			НаборЗаписей.Записать();
		КонецЕсли;

		Если НаборЗаписей.Количество() > 0
			И ЗначениеЗаполнено(НаборЗаписей[0].КлючАналитики) Тогда
			Результат = НаборЗаписей[0].КлючАналитики;
		Иначе
			Результат = СоздатьКлючАналитики(ПараметрыАналитики);
		КонецЕсли;

		Возврат Результат;
	КонецЕсли;

КонецФункции

// Функция получает элемент справочника - ключ аналитики контроля задолженности контрагентов.
//
// Параметры:
//	ПараметрыАналитики - Выборка или Структура  с полями "Контрагент, РольКонтрагента".
//
// Возвращаемое значение:
//	СправочникСсылка.КлючиКонтроляЗадолженностиПоКонтрагенту - Созданный элемент справочника.
//
Функция СоздатьКлючАналитики(ПараметрыАналитики, ЗаписьПриОбновленииИБ = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ЗначениеЗаполнено(ПараметрыАналитики.Контрагент) 
			ИЛИ ЗначениеЗаполнено(ПараметрыАналитики.РольКонтрагента) Тогда
			
		НаборЗаписей = ПолучитьНаборЗаписей(ПараметрыАналитики);
		
		Если НаборЗаписей <> Неопределено Тогда
			
			НачатьТранзакцию(); // Создание нового ключа аналитики.
			Попытка
				СтрокаНабора = НаборЗаписей[0];
				
				СправочникОбъект = Справочники.КлючиКонтроляЗадолженностиПоКонтрагенту.СоздатьЭлемент();
				СправочникОбъект.Наименование = ПолучитьПолноеНаименованиеКлючаАналитики(СтрокаНабора);
				ЗаполнитьЗначенияСвойств(СправочникОбъект, СтрокаНабора, "Контрагент, РольКонтрагента");
				Если ЗаписьПриОбновленииИБ Тогда
					ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);
				Иначе
					СправочникОбъект.Записать();
				КонецЕсли;

				Результат = СправочникОбъект.Ссылка;

				СтрокаНабора.КлючАналитики = Результат;
				
				Если ЗаписьПриОбновленииИБ Тогда
					ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей, Ложь, Истина);
				Иначе
					НаборЗаписей.Записать(Ложь);
				КонецЕсли;
				ЗафиксироватьТранзакцию();
			Исключение
				// во время инициализации ключа, данный ключ уже был создан в ИБ другим сеансом.
				НаборЗаписей.Прочитать();
				Если НаборЗаписей.Количество() = 0 Тогда // запись не создана из-за ошибки заполнения полей.
					ОтменитьТранзакцию();
					ВызватьИсключение;
				Иначе
					ОтменитьТранзакцию();
					Результат = НаборЗаписей[0].КлючАналитики;
				КонецЕсли;
			КонецПопытки;

			Возврат Результат;
			
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

// Возвращает параметры генерации ключей аналитики. Используется в обработчиках обновления.
// Возвращаемое значение:
//	Структура - Структура содержит поля: ЕстьНеобработанныеКлючи, ИзмененаАналитика, СоздаватьНовыеКлючи.
Функция ПараметрыЗаполненияКлючейАналитики() Экспорт
	Возврат Новый Структура("ИзмененаАналитика,СоздаватьВКлючи", Ложь, Истина);
КонецФункции

// Заполняет поле АналитикаКонтроляЗадолженностиПоКонтрагенту в коллекции, содержащей колонки Контрагент и РольКонтрагента.
//
// Параметры:
//
//	Коллекция - ТабличнаяЧасть - Коллекция, в которой производится заполнение аналитики контроля задолженности контрагентов.
//
//	ИменаПолей - Структура - содержит реальные имена полей коллекции для получения и формирования аналитики.
//		содержит две секции, если значение ключа Неопределено, то имя поля берется из имени ключа.
//		секция идентификации {Контрагент, РольКонтрагента, АналитикаКонтроляЗадолженностиПоКонтрагенту},
//	
//	ПараметрыЗаполнения - Структура - см. метод ПараметрыЗаполненияКлючейАналитики()
//
// Пример 1:
//	ИменаПолей = РегистрыСведений.АналитикаКонтроляЗадолженностиПоКонтрагенту.ИменаПолейКоллекцииПоУмолчанию();
//	РегистрыСведений.АналитикаКонтроляЗадолженностиПоКонтрагенту.ЗаполнитьВКоллекции(ДвиженияОперации, ИменаПолей);
//
// Пример 2:
//	РегистрыСведений.АналитикаКонтроляЗадолженностиПоКонтрагенту.ЗаполнитьВКоллекции(ДвиженияОперации);
//
Процедура ЗаполнитьВКоллекции(Коллекция, 
								ИменаПолей = Неопределено, ДополнитьКлюч = Ложь, ПараметрыЗаполнения = Неопределено) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	Если ПараметрыЗаполнения = Неопределено Тогда
		ПараметрыЗаполнения = ПараметрыЗаполненияКлючейАналитики();
	КонецЕсли;
	
	Если ДополнитьКлюч Тогда
		Если ИменаПолей = Неопределено Тогда
			ИменаПолей = ИменаПолейДополненияКоллекцииПоУмолчанию();
		КонецЕсли;
		Запрос = Новый Запрос(ТекстДополнениеКлючейАналитикиВКоллекции(ИменаПолей));
		Запрос.УстановитьПараметр("Коллекция", Коллекция);
	Иначе
		Если ИменаПолей = Неопределено Тогда
			ИменаПолей = ИменаПолейКоллекцииПоУмолчанию();
		КонецЕсли;
		Запрос = Новый Запрос(ТекстЗначенияКлючейАналитикиВКоллекции(ИменаПолей));
		Запрос.УстановитьПараметр("Коллекция", Коллекция);
		
	КонецЕсли;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Не ЗначениеЗаполнено(Выборка.АналитикаКонтроляЗадолженностиПоКонтрагенту) Тогда
			Если ПараметрыЗаполнения.СоздаватьВКлючи Тогда
				КлючАналитики = ЗначениеКлючаАналитики(Выборка);
			Иначе
				ТекстИсключения = НСтр("ru = 'Ошибка при заполнении ключей в коллекции: есть аналитики, по которым ключи еще не созданы.'");
				ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
					УровеньЖурналаРегистрации.Ошибка,
					Метаданные.Справочники.КлючиКонтроляЗадолженностиПоКонтрагенту,
					,
					ТекстИсключения);
				ВызватьИсключение ТекстИсключения;
			КонецЕсли;
		Иначе
			КлючАналитики = Выборка.АналитикаКонтроляЗадолженностиПоКонтрагенту;
		КонецЕсли;
		Если ДополнитьКлюч Тогда
			Коллекция[Выборка.Индекс][ИменаПолей.ЗаполняемаяАналитикаКонтроляЗадолженностиПоКонтрагенту] = КлючАналитики;
		Иначе
			Коллекция[Выборка.Индекс][ИменаПолей.АналитикаКонтроляЗадолженностиПоКонтрагенту] = КлючАналитики;
		КонецЕсли;
		ПараметрыЗаполнения.ИзмененаАналитика = Истина;
	КонецЦикла;
КонецПроцедуры

// Возвращает структуру полей выбора информации из коллекции для формирования аналитики контроля задолженности контрагентов.
//
// Возвращаемое значение:
//	Структура - содержит реальные имена полей коллекции для получения и формирования аналитики.
//		содержит две секции, если значение ключа Неопределено, то имя поля должно браться из имени ключа.
//		секция идентификации {Контрагент, РольКонтрагента},
//			все ключи заданы.
//
Функция ИменаПолейКоллекцииПоУмолчанию() Экспорт
	
	ИменаПолей = Новый Структура();
	ИменаПолей.Вставить("Контрагент", "Контрагент");
	ИменаПолей.Вставить("РольКонтрагента", "РольКонтрагента");
	ИменаПолей.Вставить("АналитикаКонтроляЗадолженностиПоКонтрагенту", "АналитикаКонтроляЗадолженностиПоКонтрагенту");
	
	Возврат ИменаПолей;
КонецФункции

// Возвращает структуру полей выбора информации из коллекции для формирования аналитики контроля задолженности контрагентов.
//
// Возвращаемое значение:
//	Структура - содержит реальные имена полей коллекции для получения и формирования аналитики.
//
Функция ИменаПолейДополненияКоллекцииПоУмолчанию() Экспорт
	
	ИменаПолей = Новый Структура();
	ИменаПолей.Вставить("АналитикаКонтроляЗадолженностиПоКонтрагенту", "АналитикаКонтроляЗадолженностиПоКонтрагенту");
	ИменаПолей.Вставить("ЗаполняемаяАналитикаКонтроляЗадолженностиПоКонтрагенту", "АналитикаКонтроляЗадолженностиПоКонтрагенту");
	ИменаПолей.Вставить("Контрагент", "");
	ИменаПолей.Вставить("РольКонтрагента", "");
	
	Возврат ИменаПолей;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Прочее

Функция ПолучитьНаборЗаписей(ПараметрыАналитики)
	
	// В параметрах аналитики могут быть не все свойства
	СтруктураАналитики = Новый Структура("Контрагент, РольКонтрагента");
	ЗаполнитьЗначенияСвойств(СтруктураАналитики, ПараметрыАналитики);
	Если НЕ ЗначениеЗаполнено(СтруктураАналитики.Контрагент)
	 И НЕ ЗначениеЗаполнено(СтруктураАналитики.РольКонтрагента) Тогда
		Возврат Неопределено
	Иначе
		НаборЗаписей = РегистрыСведений.АналитикаКонтроляЗадолженностиПоКонтрагенту.СоздатьНаборЗаписей();
		
		Для Каждого КлючЗначение Из СтруктураАналитики Цикл
			НаборЗаписей.Отбор[КлючЗначение.Ключ].Установить(КлючЗначение.Значение);
		КонецЦикла;
		
		НоваяСтрока = НаборЗаписей.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураАналитики, "Контрагент, РольКонтрагента");
		ПроверитьЗаполнениеПоляСтруктуры(НоваяСтрока);
		Возврат НаборЗаписей;
	КонецЕсли;
	
КонецФункции

Процедура ПроверитьЗаполнениеПоляСтруктуры(МенеджерЗаписиАналитикаКонтроляЗадолженностиПоКонтрагенту)

	Если НЕ ЗначениеЗаполнено(МенеджерЗаписиАналитикаКонтроляЗадолженностиПоКонтрагенту.Контрагент) Тогда
		ВызватьИсключение НСтр("ru = 'Должно быть заполнено значение параметра ""Контрагент""'");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(МенеджерЗаписиАналитикаКонтроляЗадолженностиПоКонтрагенту.РольКонтрагента) Тогда
		ВызватьИсключение НСтр("ru = 'Должно быть заполнено значение параметра ""РольКонтрагента""'");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеКлючейАналитикиВКоллекции

Функция ТекстЗначенияКлючейАналитикиВКоллекции(ИменаПолей)
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	АВТОНОМЕРЗАПИСИ() КАК Индекс,
	|	&ПолеАналитикаПланирования КАК АналитикаКонтроляЗадолженностиПоКонтрагенту,
	|	&ПолеКонтрагент КАК Контрагент,
	|	&ПолеРольКонтрагента КАК РольКонтрагента
	|ПОМЕСТИТЬ Коллекция
	|ИЗ
	|	&Коллекция КАК Коллекция
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Коллекция.Индекс - 1 КАК Индекс,
	|	Аналитика.КлючАналитики КАК АналитикаКонтроляЗадолженностиПоКонтрагенту,
	|	Коллекция.Контрагент КАК Контрагент,
	|	Коллекция.РольКонтрагента КАК РольКонтрагента
	|ИЗ
	|	Коллекция КАК Коллекция
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаКонтроляЗадолженностиПоКонтрагенту КАК Аналитика
	|		ПО (Аналитика.Контрагент = Коллекция.Контрагент)
	|			И (Аналитика.РольКонтрагента = Коллекция.РольКонтрагента)
	|ГДЕ
	|	(Аналитика.КлючАналитики ЕСТЬ NULL
	|			ИЛИ Аналитика.КлючАналитики <> Коллекция.АналитикаКонтроляЗадолженностиПоКонтрагенту
	|			ИЛИ Аналитика.КлючАналитики = ЗНАЧЕНИЕ(Справочник.КлючиКонтроляЗадолженностиПоКонтрагенту.ПустаяСсылка))";
	
	// заменим в тексте запроса подставляемые поля из структуры ИменаПолей
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеАналитикаПланирования", "Коллекция." + ИменаПолей.АналитикаКонтроляЗадолженностиПоКонтрагенту);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеКонтрагент", "Коллекция." + ИменаПолей.Контрагент);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеРольКонтрагента", "Коллекция." + ИменаПолей.РольКонтрагента);
	
	Возврат ТекстЗапроса;
КонецФункции

Функция ТекстДополнениеКлючейАналитикиВКоллекции(ИменаПолей)
	ТекстЗапроса = "
		|ВЫБРАТЬ
		|	Коллекция.НомерСтроки - 1 КАК Индекс,
		|	&ПолеАналитика            КАК АналитикаКонтроляЗадолженностиПоКонтрагенту,
		|	&ПолеПриемник             КАК АналитикаКонтроляЗадолженностиПоКонтрагентуПриемник,
		|	&ПолеКонтрагент			  КАК Контрагент,
		|	&ПолеРольКонтрагента	  КАК РольКонтрагента
		|ПОМЕСТИТЬ ВтКоллекция
		|ИЗ &Коллекция КАК Коллекция
		|;
		|ВЫБРАТЬ
		|	Коллекция.Индекс                       КАК Индекс,
		|	Коллекция.АналитикаКонтроляЗадолженностиПоКонтрагенту КАК АналитикаКонтроляЗадолженностиПоКонтрагенту,
		|	Коллекция.АналитикаКонтроляЗадолженностиПоКонтрагентуПриемник КАК АналитикаКонтроляЗадолженностиПоКонтрагентуПриемник,
		|	ВЫБОР КОГДА Коллекция.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|		ТОГДА ЕСТЬNULL(Аналитика.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
		|		ИНАЧЕ Коллекция.Контрагент
		|	КОНЕЦ                                КАК Контрагент,
		|	ВЫБОР КОГДА Коллекция.РольКонтрагента = ЗНАЧЕНИЕ(Перечисление.РолиКонтрагентов.ПустаяСсылка)
		|		ТОГДА ЕСТЬNULL(Аналитика.РольКонтрагента, ЗНАЧЕНИЕ(Перечисление.РолиКонтрагентов.ПустаяСсылка))
		|		ИНАЧЕ Коллекция.РольКонтрагента
		|	КОНЕЦ                                КАК РольКонтрагента
		|ПОМЕСТИТЬ Коллекция
		|ИЗ
		|	ВтКоллекция КАК Коллекция
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаКонтроляЗадолженностиПоКонтрагенту КАК Аналитика
		|	ПО Коллекция.АналитикаКонтроляЗадолженностиПоКонтрагенту = Аналитика.КлючАналитики
		|;
		|ВЫБРАТЬ
		|	Коллекция.Индекс КАК Индекс,
		|	Ключи.КлючАналитики КАК АналитикаКонтроляЗадолженностиПоКонтрагенту,
		|	Коллекция.Контрагент КАК Контрагент,
		|	Коллекция.РольКонтрагента КАК РольКонтрагента
		|ИЗ
		|	Коллекция КАК Коллекция
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаКонтроляЗадолженностиПоКонтрагенту КАК Ключи
		|	ПО Ключи.Контрагент = Коллекция.Контрагент
		|		И Ключи.РольКонтрагента = Коллекция.РольКонтрагента
		|ГДЕ
		|	Ключи.КлючАналитики ЕСТЬ NULL
		|	ИЛИ Ключи.КлючАналитики <> Коллекция.АналитикаКонтроляЗадолженностиПоКонтрагенту
		|	ИЛИ Коллекция.АналитикаКонтроляЗадолженностиПоКонтрагентуПриемник = ЗНАЧЕНИЕ(Справочник.КлючиКонтроляЗадолженностиПоКонтрагенту.ПустаяСсылка)";
	
	// заменим в тексте запроса подставляемые поля из структуры ИменаПолей
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеАналитика", "Коллекция." + ИменаПолей.АналитикаКонтроляЗадолженностиПоКонтрагенту);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеПриемник", "Коллекция." + ИменаПолей.ЗаполняемаяАналитикаКонтроляЗадолженностиПоКонтрагенту);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеКонтрагент", "Коллекция." + ИменаПолей.Контрагент);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеРольКонтрагента", "Коллекция." + ИменаПолей.РольКонтрагента);
	
	Возврат ТекстЗапроса;
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
